galowicz/reneduino_micro_f14_drv/Cfg/iodefine_ext_R5F10AGE.h
/*
 Sfr bits
 */
#define ADTYP ADM2_bit.no0
#define AWC ADM2_bit.no2
#define ADRCK ADM2_bit.no3
#define DFLEN DFLCTL_bit.no0
#define TAU0EN PER0_bit.no0
#define SAU0EN PER0_bit.no2
#define ADCEN PER0_bit.no5
#define RTCEN PER0_bit.no7
#define TRDSYNC TRDMR_bit.no0
#define TRDBFC0 TRDMR_bit.no4
#define TRDBFD0 TRDMR_bit.no5
#define TRDBFC1 TRDMR_bit.no6
#define TRDBFD1 TRDMR_bit.no7
#define TRDPWMB0 TRDPMR_bit.no0
#define TRDPWMC0 TRDPMR_bit.no1
#define TRDPWMD0 TRDPMR_bit.no2
#define TRDPWMB1 TRDPMR_bit.no4
#define TRDPWMC1 TRDPMR_bit.no5
#define TRDPWMD1 TRDPMR_bit.no6
#define TRDSHUTS TRDOER2_bit.no0
#define TRDPTO TRDOER2_bit.no7
#define TRJ0EN PER1_bit.no0
#define DTCEN PER1_bit.no3
#define TRD0EN PER1_bit.no4
#define LIN0EN PER2_bit.no2
#define LIN0MCK LINCKSEL_bit.no0
#define LIN0MCKE LINCKSEL_bit.no4
#define SELLOSC CKSEL_bit.no0
#define TRD_CKSEL CKSEL_bit.no2
#define PLLON PLLCTL_bit.no0
#define PLLMUL PLLCTL_bit.no1
#define SELPLL PLLCTL_bit.no2
#define PLLDIV0 PLLCTL_bit.no4
#define PLLDIV1 PLLCTL_bit.no5
#define LCKSEL0 PLLCTL_bit.no6
#define LCKSEL1 PLLCTL_bit.no7
#define SELPLLS PLLSTS_bit.no3
#define LOCK PLLSTS_bit.no7
#define POCRES0 POCRES_bit.no0
#define CLKRF POCRES_bit.no4
#define STPLV STPSTC_bit.no4
#define STPOEN STPSTC_bit.no7
#define HMODE0 HDTCCR0_bit.no0
#define HRPTSEL0 HDTCCR0_bit.no1
#define HSAMOD0 HDTCCR0_bit.no2
#define HDAMOD0 HDTCCR0_bit.no3
#define HCHNE0 HDTCCR0_bit.no4
#define HRPTINT0 HDTCCR0_bit.no5
#define HSZ0 HDTCCR0_bit.no6
#define HMODE1 HDTCCR1_bit.no0
#define HRPTSEL1 HDTCCR1_bit.no1
#define HSAMOD1 HDTCCR1_bit.no2
#define HDAMOD1 HDTCCR1_bit.no3
#define HCHNE1 HDTCCR1_bit.no4
#define HRPTINT1 HDTCCR1_bit.no5
#define HSZ1 HDTCCR1_bit.no6
#define DTCEN00 DTCEN0_bit.no0
#define DTCEN01 DTCEN0_bit.no1
#define DTCEN02 DTCEN0_bit.no2
#define DTCEN03 DTCEN0_bit.no3
#define DTCEN04 DTCEN0_bit.no4
#define DTCEN05 DTCEN0_bit.no5
#define DTCEN06 DTCEN0_bit.no6
#define DTCEN10 DTCEN1_bit.no0
#define DTCEN11 DTCEN1_bit.no1
#define DTCEN14 DTCEN1_bit.no4
#define DTCEN15 DTCEN1_bit.no5
#define DTCEN16 DTCEN1_bit.no6
#define DTCEN17 DTCEN1_bit.no7
#define DTCEN20 DTCEN2_bit.no0
#define DTCEN21 DTCEN2_bit.no1
#define DTCEN22 DTCEN2_bit.no2
#define DTCEN23 DTCEN2_bit.no3
#define DTCEN24 DTCEN2_bit.no4
#define DTCEN25 DTCEN2_bit.no5
#define DTCEN30 DTCEN3_bit.no0
#define DTCEN31 DTCEN3_bit.no1
#define DTCEN32 DTCEN3_bit.no2
#define DTCEN33 DTCEN3_bit.no3
#define DTCEN34 DTCEN3_bit.no4
#define DTCEN35 DTCEN3_bit.no5
#define DTCEN36 DTCEN3_bit.no6
#define DTCEN37 DTCEN3_bit.no7
#define DTCEN45 DTCEN4_bit.no5
#define DTCEN46 DTCEN4_bit.no6
#define DTCEN47 DTCEN4_bit.no7
#define CRC0EN CRC0CTL_bit.no7

/*
 Interrupt vector addresses
 */
#endif
